erpdev.СХК_Расширение/src/Documents/Расш1_ОтгрузкаФакт/Расш1_ОтгрузкаФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расш1_ОтгрузкаФакт</name>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИОВодителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПалетМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Расш1_СтатусОтгрузкаФакт</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправленно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактПалетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГСМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Часы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АмортизацияТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГСМРуб</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КМСырье</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоШтук</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрочиРасходыТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьНаемнойМашины</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыСырье</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧасыГелиос</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГСМГелиос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КМГелиос</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПростоя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заезд</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Выезд</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧОрдер</name>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>ТК</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТарифПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТарифПлан2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТарифФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТарифФакт2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Возврат</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧОтгрузка</name>
    <attributes>
      <name>Отгрузка</name>
      <type>
        <types>DocumentRef.РасходныйОрдерНаТовары</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Приобретение</name>
    <attributes>
      <name>ПоступлениеУслуг</name>
      <type>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ПриобретениеУслугПрочихАктивов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Движение</name>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачальноеПоложение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонечноеПоложение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатыСтарт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоординатыСтоп</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Documents/Расш1_ОтгрузкаФакт/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриОткрытииНаСервере()
	Дата = ТекущаяДата();
	ПолучитьКоличествоНаСервере(Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры   

&НаСервере
Процедура ПолучитьКоличествоНаСервере(Дата)
	ЭтаФорма.Количество = 0;
Запрос = Новый Запрос;
Запрос.Текст = "ВЫБРАТЬ
               |	Расш1_ОтгрузкаФакт.Ссылка КАК Ссылка
               |ИЗ
               |	Документ.Расш1_ОтгрузкаФакт КАК Расш1_ОтгрузкаФакт
               |ГДЕ
               |	Расш1_ОтгрузкаФакт.Дата МЕЖДУ &ДатаНачада И &ДатаОкончания
               |	И Расш1_ОтгрузкаФакт.Проведен = &Проведен
               |	И Расш1_ОтгрузкаФакт.ПометкаУдаления = &ПометкаУдаления";  
Запрос.УстановитьПараметр("ДатаНачада",НачалоДня(Дата));
Запрос.УстановитьПараметр("ДатаОкончания",КонецДня(Дата));
Запрос.УстановитьПараметр("Проведен",Истина);
Запрос.УстановитьПараметр("ПометкаУдаления",Ложь);
Рез = Запрос.Выполнить().Выбрать(); 
к = 0;
Пока Рез.Следующий() Цикл
	Попытка
		Для Каждого стр из Рез.Ссылка.ТЧОрдер Цикл 
			Док = стр.ЗаказКлиента.ПолучитьОбъект();
			к = к + Док.Товары.Итог("КоличествоУпаковок");
		КонецЦикла;
	Исключение
	КонецПопытки;
	
		//к = к + Рез.Ссылка.Товары.Итог("КоличествоУпаковок");
	КонецЦикла;
ЭтаФорма.Количество = к;
	
КонецПроцедуры

&НаКлиенте
Процедура Дата1ПриИзменении(Элемент)
	ПолучитьКоличествоНаСервере(Дата);
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	Парам = Новый Структура;

	Парам.Вставить("text",Строка("за " + Строка(Формат(Дата,"ДЛФ=Д")) + Строка(" отправлено ")+Строка(Количество) + Строка(" шт")));

	Сервер = "192.168.88.146:8000/bot/";
	Соединение =  Новый HTTPСоединение(Сервер,,,,,90,,);
	
	Заголовки = Новый Соответствие; 
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	ЗаписьJSON = Новый ЗаписьJSON;
	
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON();
	ЗаписьJSON.ОткрытьФайл(КаталогВременныхФайлов()+"contr.json", , , ПараметрыЗаписи) ;
	ЗаписатьJSON(ЗаписьJSON, Парам);
	
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Парам);
	СтрJSON = ЗаписьJSON.Закрыть(); 
	
	
	Запрос = Новый HTTPЗапрос("day/",Заголовки);
	Запрос.УстановитьТелоИзСтроки("present="+СтрJSON); 
	
	ФайлРезультата = ПолучитьИмяВременногоФайла();
	Соединение.ОтправитьДляОбработки(Запрос,ФайлРезультата);
	
	ТекстовыйФайлОтвет = Новый ТекстовыйДокумент;
	ТекстовыйФайлОтвет.Прочитать(ФайлРезультата,КодировкаТекста.UTF8);
	СтрокаОтветСервера = ТекстовыйФайлОтвет.ПолучитьТекст(); 

КонецПроцедуры

&НаКлиенте
Процедура Отчет(Команда)
	ОткрытьФорму("Отчет.ОтгрузкаСоСкладаЗаПериод.Форма");
КонецПроцедуры
